#include <stdio.h>

int main()
{
    
int sum = 0, sum_all =0, n = 10, k = 12, min, max, grmin, grmax, min_zp, max_zp, grmin_zp, grmax_zp;
int tmp_arr[12] = {0};
int tmp_arr2[10] = {0};

//прибыль подразделений
int overmoney[10][12] =
{
{ 100, 101, 102, 104, 106, 102, 200, 201, 150, 200, 199, 167 }, 
{ 102, 104, 100, 99, 200, 89, 94, 89, 122, 220, 179, 147 }, 
{ 99, 56, 98, 234, 123, 105, 205, 97, 221, 178, 150, 140 },
{ 58, 104, 100, 99, 45, 89, 94, 89, 123, 66, 179, 122 },
{ 234, 100, 90, 99, 134, 65, 94, 89, 122, 228, 123, 149 },
{ 123, 100, 100, 99, 200, 89, 91, 92, 99, 80, 30, 200 },
{ 199, 101, 98, 95, 89, 87, 56, 99, 90, 220, 179, 147 },
{ 112, 124, 100, 99, 200, 112, 122, 89, 500, 345, 100, 90 },
{ 122, 104, 100, 134, 289, 34, 45, 78, 122, 220, 179, 134 },
{ 110, 214, 100, 79, 100, 89, 94, 321, 122, 220, 179, 532 },
};
//средняя зарплата сотрудников 
int zp[10] = {100, 120, 102, 130, 140, 99, 102, 104, 105, 122};

////сумараня годовая прибыль по каждому подразделению
 for(int i=0; i<n; i++) { 
      
     for(int j=0; j<k; j++) { 
        
        //Годовая прибыль подразделения
        sum += overmoney[i][j];
        
        
        //Суммарная прибыль всех подразделений в месяце
        tmp_arr[j] += overmoney[i][j];
        
    } 
    
         printf("\nГодовая прибыль подразделения N%d: %d", i+1, sum);
         
         //запомнили готовубю прибыль по подразделениям
         tmp_arr2[i] = sum;
       printf(" и среднемесячная прибыль подразделения: %d", sum/k);
        sum = 0;
        
  }
  
printf("\n\n");

for(int i=0; i<k; i++) { 
       printf("\nСуммарная прибыль всех подразделений в месяце %d: %d", i+1, tmp_arr[i]);
       sum_all += tmp_arr[i];
  }

min = tmp_arr2[0];
max = tmp_arr2[0];
min_zp = zp[0];
max_zp = zp[0];

printf("\n\n");
  
for(int i=0; i<n; i++) { 
   
   //доля в % каждого подразделения в общей годовой выручке
   printf("Доля подразделения N%d в общей годовой выручке: %lf \n", i+1, (double)tmp_arr2[i]/sum_all*100);  
     if(min > tmp_arr2[i])
        {
            min = tmp_arr2[i];
            grmin = i;
        }
        else if(max < tmp_arr2[i])
        {
            max = tmp_arr2[i];
            grmax = i;
        }
        
        
        if(min_zp > zp[i])
        {
            min_zp = zp[i];
            grmin_zp = i;
        }
        else if(max_zp < zp[i])
        {
            max_zp = zp[i];
            grmax_zp = i;
        }
    
}
    //Номера подразделений, имеющие наименьшую и наибольшую годовую прибыль
    printf("\nПодразделение %d c прибылью(max): %d и подразделение %d с прибылью(min) %d", grmax+1, max, grmin+1, min);  
    printf("\nПодразделение %d c зарплатой(max): %d и подразделение %d с зарплатой(min) %d", grmax_zp+1, max_zp, grmin_zp+1, min_zp);
    
    return 0;
}
